### Create a Python connection with SQL database and retrieve the results of the last two queries (also mentioned below) as dataframes:

In [1]:
! pip install sqlalchemy
! pip install PyMySQL

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: sqlalchemy in c:\programdata\anaconda3\lib\site-packages (1.4.39)
Requirement already satisfied: greenlet!=0.4.17 in c:\programdata\anaconda3\lib\site-packages (from sqlalchemy) (2.0.1)
Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: PyMySQL in c:\users\grwc9\appdata\roaming\python\python310\site-packages (1.0.3)

In [113]:
import pymysql
from sqlalchemy import create_engine
import pandas as pd
import getpass
password = getpass.getpass()

········

In [114]:
connection_string = 'mysql+pymysql://root:' + password + '@localhost/sakila'
engine = create_engine(connection_string)

#### Check the number of rentals for each customer for May

In [120]:
df_may = pd.read_sql_query(
    '''SELECT customer_id id, COUNT(*) rentals FROM rentals_may
    GROUP BY id;''',
    engine
)
df_may

      id  rentals
0    130        3
1    459        1
2    408        3
3    333        1
4    222        5
..   ...      ...
515  191        2
516  351        1
517   10        1
518  136        1
519   61        1

[520 rows x 2 columns]

#### Check the number of rentals for each customer for June

In [121]:
df_jun = pd.read_sql_query(
    '''SELECT customer_id id, COUNT(*) rentals FROM rentals_june
    GROUP BY id;''',
    engine
)
df_jun

      id  rentals
0    416        5
1    516        6
2    239        5
3    285        3
4    310        6
..   ...      ...
585  412        1
586  335        1
587  226        2
588   22        1
589  126        1

[590 rows x 2 columns]

### Write a function that checks if customer borrowed more or less films in the month of June as compared to May.

In [122]:
df_merge = df_may.merge(df_jun, left_on='id', right_on='id', suffixes=('_may', '_jun'))
df_merge

      id  rentals_may  rentals_jun
0    130            3            6
1    459            1            7
2    408            3            3
3    333            1            4
4    222            5            2
..   ...          ...          ...
507  431            1            7
508  191            2            6
509  351            1            3
510   10            1            5
511  136            1            1

[512 rows x 3 columns]

In [144]:
def borrowed(c_id):
    if df_merge.rentals_may[df_merge.id == c_id].tolist() > df_merge.rentals_jun[df_merge.id == c_id].tolist():
        return 'Less'
    elif df_merge.rentals_may[df_merge.id == c_id].tolist() < df_merge.rentals_jun[df_merge.id == c_id].tolist():
        return 'More'
    else:
        return 'Same'

In [145]:
test1 = borrowed(130)
test2 = borrowed(408)
test3 = borrowed(222)
print('130:', test1)
print('408:', test2)
print('222:', test3)

130: More
408: Same
222: Less